tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1718_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1718_H_
#define _PIC16LF1718_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSP1IF                        68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define TMR4IF                        75
#define TMR6IF                        76
#define BCL1IF                        77
#define C1IF                          78
#define C2IF                          79
#define OSFIF                         80
#define PIR3                          81
#define CLC1IF                        82
#define CLC2IF                        83
#define CLC3IF                        84
#define CLC4IF                        85
#define ZCDIF                         86
#define COGIF                         87
#define NCOIF                         88
#define TMR0                          89
#define TMR1L                         90
#define TMR1H                         91
#define T1CON                         92
#define TMR1ON                        93
#define nT1SYNC                       94
#define T1OSCEN                       95
#define T1CKPS0                       96
#define T1CKPS                        97
#define T1CKPS1                       98
#define TMR1CS0                       99
#define TMR1CS                        100
#define TMR1CS1                       101
#define T1GCON                        102
#define T1GSS0                        103
#define T1GSS                         104
#define T1GSS1                        105
#define T1GVAL                        106
#define T1GGO_nDONE                   107
#define T1GSPM                        108
#define T1GTM                         109
#define T1GPOL                        110
#define TMR1GE                        111
#define TMR2                          112
#define PR2                           113
#define T2CON                         114
#define T2CKPS0                       115
#define T2CKPS                        116
#define T2CKPS1                       117
#define TMR2ON                        118
#define T2OUTPS0                      119
#define T2OUTPS                       120
#define T2OUTPS1                      121
#define T2OUTPS2                      122
#define T2OUTPS3                      123
#define TRISA                         124
#define TRISA0                        125
#define TRISA1                        126
#define TRISA2                        127
#define TRISA3                        128
#define TRISA4                        129
#define TRISA5                        130
#define TRISA6                        131
#define TRISA7                        132
#define TRISB                         133
#define TRISB0                        134
#define TRISB1                        135
#define TRISB2                        136
#define TRISB3                        137
#define TRISB4                        138
#define TRISB5                        139
#define TRISB6                        140
#define TRISB7                        141
#define TRISC                         142
#define TRISC0                        143
#define TRISC1                        144
#define TRISC2                        145
#define TRISC3                        146
#define TRISC4                        147
#define TRISC5                        148
#define TRISC6                        149
#define TRISC7                        150
#define TRISE                         151
#define TRISE3                        152
#define PIE1                          153
#define TMR1IE                        154
#define TMR2IE                        155
#define CCP1IE                        156
#define SSP1IE                        157
#define TXIE                          158
#define RCIE                          159
#define ADIE                          160
#define TMR1GIE                       161
#define PIE2                          162
#define CCP2IE                        163
#define TMR4IE                        164
#define TMR6IE                        165
#define BCL1IE                        166
#define C1IE                          167
#define C2IE                          168
#define OSFIE                         169
#define PIE3                          170
#define CLC1IE                        171
#define CLC2IE                        172
#define CLC3IE                        173
#define CLC4IE                        174
#define ZCDIE                         175
#define COGIE                         176
#define NCOIE                         177
#define OPTION_REG                    178
#define PS                            179
#define PS0                           180
#define PS1                           181
#define PS2                           182
#define PSA                           183
#define T0SE                          184
#define TMR0SE                        185
#define T0CS                          186
#define TMR0CS                        187
#define INTEDG                        188
#define nWPUEN                        189
#define PCON                          190
#define nBOR                          191
#define nPOR                          192
#define nRI                           193
#define nRMCLR                        194
#define nRWDT                         195
#define STKUNF                        196
#define STKOVF                        197
#define WDTCON                        198
#define SWDTEN                        199
#define WDTPS                         200
#define WDTPS0                        201
#define WDTPS1                        202
#define WDTPS2                        203
#define WDTPS3                        204
#define WDTPS4                        205
#define OSCTUNE                       206
#define TUN0                          207
#define TUN                           208
#define TUN1                          209
#define TUN2                          210
#define TUN3                          211
#define TUN4                          212
#define TUN5                          213
#define OSCCON                        214
#define SCS0                          215
#define SCS                           216
#define SCS1                          217
#define IRCF                          218
#define IRCF0                         219
#define IRCF1                         220
#define IRCF2                         221
#define IRCF3                         222
#define SPLLEN                        223
#define OSCSTAT                       224
#define HFIOFS                        225
#define LFIOFR                        226
#define MFIOFR                        227
#define HFIOFL                        228
#define HFIOFR                        229
#define OSTS                          230
#define PLLR                          231
#define SOSCR                         232
#define ADRESL                        233
#define ADRESH                        234
#define ADCON0                        235
#define ADON                          236
#define GO_nDONE                      237
#define GO                            238
#define ADGO                          239
#define CHS0                          240
#define CHS                           241
#define CHS1                          242
#define CHS2                          243
#define CHS3                          244
#define CHS4                          245
#define ADCON1                        246
#define ADPREF0                       247
#define ADPREF                        248
#define ADPREF1                       249
#define ADNREF                        250
#define ADCS                          251
#define ADFM                          252
#define ADCON2                        253
#define TRIGSEL                       254
#define TRIGSEL0                      255
#define TRIGSEL1                      256
#define TRIGSEL2                      257
#define TRIGSEL3                      258
#define LATA                          259
#define LATA0                         260
#define LATA1                         261
#define LATA2                         262
#define LATA3                         263
#define LATA4                         264
#define LATA5                         265
#define LATA6                         266
#define LATA7                         267
#define LATB                          268
#define LATB0                         269
#define LATB1                         270
#define LATB2                         271
#define LATB3                         272
#define LATB4                         273
#define LATB5                         274
#define LATB6                         275
#define LATB7                         276
#define LATC                          277
#define LATC0                         278
#define LATC1                         279
#define LATC2                         280
#define LATC3                         281
#define LATC4                         282
#define LATC5                         283
#define LATC6                         284
#define LATC7                         285
#define CM1CON0                       286
#define C1SYNC                        287
#define C1HYS                         288
#define C1SP                          289
#define C1ZLF                         290
#define C1POL                         291
#define C1OUT                         292
#define C1ON                          293
#define CM1CON1                       294
#define C1NCH0                        295
#define C1NCH                         296
#define C1NCH1                        297
#define C1NCH2                        298
#define C1PCH                         299
#define C1PCH0                        300
#define C1PCH1                        301
#define C1PCH2                        302
#define C1INTN                        303
#define C1INTP                        304
#define CM2CON0                       305
#define C2SYNC                        306
#define C2HYS                         307
#define C2SP                          308
#define C2ZLF                         309
#define C2POL                         310
#define C2OUT                         311
#define C2ON                          312
#define CM2CON1                       313
#define C2NCH0                        314
#define C2NCH                         315
#define C2NCH1                        316
#define C2NCH2                        317
#define C2PCH                         318
#define C2PCH0                        319
#define C2PCH1                        320
#define C2PCH2                        321
#define C2INTN                        322
#define C2INTP                        323
#define CMOUT                         324
#define MC1OUT                        325
#define MC2OUT                        326
#define BORCON                        327
#define BORRDY                        328
#define BORFS                         329
#define SBOREN                        330
#define FVRCON                        331
#define ADFVR0                        332
#define ADFVR                         333
#define ADFVR1                        334
#define CDAFVR                        335
#define CDAFVR0                       336
#define CDAFVR1                       337
#define TSRNG                         338
#define TSEN                          339
#define FVRRDY                        340
#define FVREN                         341
#define DAC1CON0                      342
#define DAC1CON0_DACNSS               343
#define DAC1NSS                       344
#define DAC1PSS                       345
#define DAC1CON0_DACPSS               346
#define DAC1CON0_DACPSS0              347
#define DAC1PSS0                      348
#define DAC1CON0_DACPSS1              349
#define DAC1PSS1                      350
#define DACOE0                        351
#define DAC1OE2                       352
#define DAC1OE1                       353
#define DAC1CON0_DACOE1               354
#define DAC1CON0_DACEN                355
#define DAC1EN                        356
#define DAC1CON1                      357
#define DAC1R                         358
#define DAC1R0                        359
#define DAC1CON1_DACR0                360
#define DAC1R1                        361
#define DAC1CON1_DACR1                362
#define DAC1R2                        363
#define DAC1CON1_DACR2                364
#define DAC1R3                        365
#define DAC1CON1_DACR3                366
#define DAC1R4                        367
#define DAC1CON1_DACR4                368
#define DACR5                         369
#define DAC1R5                        370
#define DACR6                         371
#define DAC1R6                        372
#define DACR7                         373
#define DAC1R7                        374
#define DAC2CON0                      375
#define DAC2CON0_DACNSS               376
#define DAC2NSS                       377
#define NSS                           378
#define DAC2CON0_DACPSS0              379
#define DAC2PSS0                      380
#define DAC2PSS                       381
#define PSS0                          382
#define DAC2CON0_DACPSS               383
#define PSS                           384
#define DAC2CON0_DACPSS1              385
#define PSS1                          386
#define DAC2PSS1                      387
#define OE2                           388
#define DACOE2                        389
#define DAC2OE2                       390
#define OE1                           391
#define DAC2CON0_DACOE1               392
#define DAC2OE1                       393
#define DAC2EN                        394
#define DAC2CON0_DACEN                395
#define DAC2CON0_EN                   396
#define DAC2REF                       397
#define DAC2REF_DACR0                 398
#define REF0                          399
#define DACR                          400
#define DAC2REF0                      401
#define R0                            402
#define DAC2R                         403
#define DAC2R0                        404
#define DAC2REF1                      405
#define REF1                          406
#define DAC2REF_DACR1                 407
#define R1                            408
#define DAC2R1                        409
#define DAC2REF2                      410
#define REF2                          411
#define DAC2REF_DACR2                 412
#define R2                            413
#define DAC2R2                        414
#define DAC2REF3                      415
#define REF3                          416
#define DAC2REF_DACR3                 417
#define R3                            418
#define DAC2R3                        419
#define REF4                          420
#define R4                            421
#define DAC2REF_DACR4                 422
#define DAC2REF4                      423
#define DAC2R4                        424
#define REF5                          425
#define DAC2REF5                      426
#define ZCD1CON                       427
#define ZCD1INTN                      428
#define ZCD1INTP                      429
#define ZCD1POL                       430
#define ZCD1OUT                       431
#define ZCD1EN                        432
#define ANSELA                        433
#define ANSA0                         434
#define ANSA1                         435
#define ANSA2                         436
#define ANSA3                         437
#define ANSA4                         438
#define ANSA5                         439
#define ANSELB                        440
#define ANSB0                         441
#define ANSB1                         442
#define ANSB2                         443
#define ANSB3                         444
#define ANSB4                         445
#define ANSB5                         446
#define ANSELC                        447
#define ANSC2                         448
#define ANSC3                         449
#define ANSC4                         450
#define ANSC5                         451
#define ANSC6                         452
#define ANSC7                         453
#define PMADRL                        454
#define PMADRH                        455
#define PMDATL                        456
#define PMDATH                        457
#define PMCON1                        458
#define RD                            459
#define WR                            460
#define WREN                          461
#define WRERR                         462
#define FREE                          463
#define LWLO                          464
#define CFGS                          465
#define PMCON2                        466
#define RC1REG                        467
#define TX1REG                        468
#define SP1BRGL                       469
#define SP1BRGH                       470
#define RC1STA                        471
#define RX9D                          472
#define OERR                          473
#define FERR                          474
#define ADDEN                         475
#define CREN                          476
#define SREN                          477
#define RX9                           478
#define SPEN                          479
#define TX1STA                        480
#define TX9D                          481
#define TRMT                          482
#define BRGH                          483
#define SENDB                         484
#define SYNC                          485
#define TXEN                          486
#define TX9                           487
#define CSRC                          488
#define BAUD1CON                      489
#define ABDEN                         490
#define WUE                           491
#define BRG16                         492
#define SCKP                          493
#define RCIDL                         494
#define ABDOVF                        495
#define WPUA                          496
#define WPUA0                         497
#define WPUA1                         498
#define WPUA2                         499
#define WPUA3                         500
#define WPUA4                         501
#define WPUA5                         502
#define WPUA6                         503
#define WPUA7                         504
#define WPUB                          505
#define WPUB0                         506
#define WPUB1                         507
#define WPUB2                         508
#define WPUB3                         509
#define WPUB4                         510
#define WPUB5                         511
#define WPUB6                         512
#define WPUB7                         513
#define WPUC                          514
#define WPUC0                         515
#define WPUC1                         516
#define WPUC2                         517
#define WPUC3                         518
#define WPUC4                         519
#define WPUC5                         520
#define WPUC6                         521
