tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1718_tdd.h
#define WPUC7                         522
#define WPUE                          523
#define WPUE3                         524
#define SSP1BUF                       525
#define BUF                           526
#define BUF0                          527
#define SSP1BUF0                      528
#define BUF1                          529
#define SSP1BUF1                      530
#define BUF2                          531
#define SSP1BUF2                      532
#define BUF3                          533
#define SSP1BUF3                      534
#define BUF4                          535
#define SSP1BUF4                      536
#define BUF5                          537
#define SSP1BUF5                      538
#define BUF6                          539
#define SSP1BUF6                      540
#define BUF7                          541
#define SSP1BUF7                      542
#define ADD0                          543
#define ADD                           544
#define SSP1ADD0                      545
#define SSP1ADD                       546
#define ADD1                          547
#define SSP1ADD1                      548
#define ADD2                          549
#define SSP1ADD2                      550
#define ADD3                          551
#define SSP1ADD3                      552
#define ADD4                          553
#define SSP1ADD4                      554
#define ADD5                          555
#define SSP1ADD5                      556
#define ADD6                          557
#define SSP1ADD6                      558
#define ADD7                          559
#define SSP1ADD7                      560
#define SSP1MSK0                      561
#define SSP1MSK                       562
#define MSK0                          563
#define MSK                           564
#define SSP1MSK1                      565
#define MSK1                          566
#define SSP1MSK2                      567
#define MSK2                          568
#define SSP1MSK3                      569
#define MSK3                          570
#define SSP1MSK4                      571
#define MSK4                          572
#define SSP1MSK5                      573
#define MSK5                          574
#define SSP1MSK6                      575
#define MSK6                          576
#define SSP1MSK7                      577
#define MSK7                          578
#define SSP1STAT                      579
#define BF                            580
#define UA                            581
#define R_nW                          582
#define S                             583
#define P                             584
#define D_nA                          585
#define CKE                           586
#define SMP                           587
#define SSP1CON1                      588
#define SSPM0                         589
#define SSPM                          590
#define SSPM1                         591
#define SSPM2                         592
#define SSPM3                         593
#define CKP                           594
#define SSPEN                         595
#define SSPOV                         596
#define WCOL                          597
#define SSP1CON2                      598
#define SEN                           599
#define RSEN                          600
#define PEN                           601
#define RCEN                          602
#define ACKEN                         603
#define ACKDT                         604
#define ACKSTAT                       605
#define GCEN                          606
#define SSP1CON3                      607
#define DHEN                          608
#define AHEN                          609
#define SBCDE                         610
#define SDAHT                         611
#define BOEN                          612
#define SCIE                          613
#define PCIE                          614
#define ACKTIM                        615
#define ODCONA                        616
#define ODA0                          617
#define ODA1                          618
#define ODA2                          619
#define ODA3                          620
#define ODA4                          621
#define ODA5                          622
#define ODA6                          623
#define ODA7                          624
#define ODCONB                        625
#define ODB0                          626
#define ODB1                          627
#define ODB2                          628
#define ODB3                          629
#define ODB4                          630
#define ODB5                          631
#define ODB6                          632
#define ODB7                          633
#define ODCONC                        634
#define ODC0                          635
#define ODC1                          636
#define ODC2                          637
#define ODC3                          638
#define ODC4                          639
#define ODC5                          640
#define ODC6                          641
#define ODC7                          642
#define CCPR1L                        643
#define CCPR1H                        644
#define CCP1CON                       645
#define CCP1M0                        646
#define CCP1M                         647
#define CCP1M1                        648
#define CCP1M2                        649
#define CCP1M3                        650
#define CCP1Y                         651
#define DC1B                          652
#define DC1B0                         653
#define CCP1X                         654
#define DC1B1                         655
#define CCPR2L                        656
#define CCPR2H                        657
#define CCP2CON                       658
#define CCP2M                         659
#define CCP2M0                        660
#define CCP2M1                        661
#define CCP2M2                        662
#define CCP2M3                        663
#define DC2B0                         664
#define CCP2Y                         665
#define DC2B                          666
#define DC2B1                         667
#define CCP2X                         668
#define CCPTMRS                       669
#define C1TSEL0                       670
#define C1TSEL                        671
#define C1TSEL1                       672
#define C2TSEL0                       673
#define C2TSEL                        674
#define C2TSEL1                       675
#define P3TSEL                        676
#define P3TSEL0                       677
#define P3TSEL1                       678
#define P4TSEL0                       679
#define P4TSEL                        680
#define P4TSEL1                       681
#define SLRCONA                       682
#define SLRA0                         683
#define SLRA1                         684
#define SLRA2                         685
#define SLRA3                         686
#define SLRA4                         687
#define SLRA5                         688
#define SLRA6                         689
#define SLRA7                         690
#define SLRCONB                       691
#define SLRB0                         692
#define SLRB1                         693
#define SLRB2                         694
#define SLRB3                         695
#define SLRB4                         696
#define SLRB5                         697
#define SLRB6                         698
#define SLRB7                         699
#define SLRCONC                       700
#define SLRC0                         701
#define SLRC1                         702
#define SLRC2                         703
#define SLRC3                         704
#define SLRC4                         705
#define SLRC5                         706
#define SLRC6                         707
#define SLRC7                         708
#define INLVLA                        709
#define INLVLA0                       710
#define INLVLA1                       711
#define INLVLA2                       712
#define INLVLA3                       713
#define INLVLA4                       714
#define INLVLA5                       715
#define INLVLA6                       716
#define INLVLA7                       717
#define INLVLB                        718
#define INLVLB0                       719
#define INLVLB1                       720
#define INLVLB2                       721
#define INLVLB3                       722
#define INLVLB4                       723
#define INLVLB5                       724
#define INLVLB6                       725
#define INLVLB7                       726
#define INLVLC                        727
#define INLVLC0                       728
#define INLVLC1                       729
#define INLVLC2                       730
#define INLVLC3                       731
#define INLVLC4                       732
#define INLVLC5                       733
#define INLVLC6                       734
#define INLVLC7                       735
#define INLVLE                        736
#define INLVLE3                       737
#define IOCAP                         738
#define IOCAP0                        739
#define IOCAP1                        740
#define IOCAP2                        741
#define IOCAP3                        742
#define IOCAP4                        743
#define IOCAP5                        744
#define IOCAP6                        745
#define IOCAP7                        746
#define IOCAN                         747
#define IOCAN0                        748
#define IOCAN1                        749
#define IOCAN2                        750
#define IOCAN3                        751
#define IOCAN4                        752
#define IOCAN5                        753
#define IOCAN6                        754
#define IOCAN7                        755
#define IOCAF                         756
#define IOCAF0                        757
#define IOCAF1                        758
#define IOCAF2                        759
#define IOCAF3                        760
#define IOCAF4                        761
#define IOCAF5                        762
#define IOCAF6                        763
#define IOCAF7                        764
#define IOCBP                         765
#define IOCBP0                        766
#define IOCBP1                        767
#define IOCBP2                        768
#define IOCBP3                        769
#define IOCBP4                        770
#define IOCBP5                        771
#define IOCBP6                        772
#define IOCBP7                        773
#define IOCBN                         774
#define IOCBN0                        775
#define IOCBN1                        776
#define IOCBN2                        777
#define IOCBN3                        778
#define IOCBN4                        779
#define IOCBN5                        780
#define IOCBN6                        781
#define IOCBN7                        782
#define IOCBF                         783
#define IOCBF0                        784
#define IOCBF1                        785
#define IOCBF2                        786
#define IOCBF3                        787
#define IOCBF4                        788
#define IOCBF5                        789
#define IOCBF6                        790
#define IOCBF7                        791
#define IOCCP                         792
#define IOCCP0                        793
#define IOCCP1                        794
#define IOCCP2                        795
#define IOCCP3                        796
#define IOCCP4                        797
#define IOCCP5                        798
#define IOCCP6                        799
#define IOCCP7                        800
#define IOCCN                         801
#define IOCCN0                        802
#define IOCCN1                        803
#define IOCCN2                        804
#define IOCCN3                        805
#define IOCCN4                        806
#define IOCCN5                        807
#define IOCCN6                        808
#define IOCCN7                        809
#define IOCCF                         810
#define IOCCF0                        811
#define IOCCF1                        812
#define IOCCF2                        813
#define IOCCF3                        814
#define IOCCF4                        815
#define IOCCF5                        816
#define IOCCF6                        817
#define IOCCF7                        818
#define IOCEP                         819
#define IOCEP3                        820
#define IOCEN                         821
#define IOCEN3                        822
#define IOCEF                         823
#define IOCEF3                        824
#define TMR4                          825
#define PR4                           826
#define T4CON                         827
#define T4CKPS0                       828
#define T4CKPS                        829
#define T4CKPS1                       830
#define TMR4ON                        831
#define T4OUTPS                       832
#define T4OUTPS0                      833
#define T4OUTPS1                      834
#define T4OUTPS2                      835
#define T4OUTPS3                      836
#define TMR6                          837
#define PR6                           838
#define T6CON                         839
#define T6CKPS0                       840
#define T6CKPS                        841
#define T6CKPS1                       842
#define TMR6ON                        843
#define T6OUTPS0                      844
#define T6OUTPS                       845
#define T6OUTPS1                      846
#define T6OUTPS2                      847
#define T6OUTPS3                      848
#define NCO1ACCL                      849
#define NCO1ACCL_NCO1ACC              850
#define NCO1ACC0                      851
#define NCO1ACC1                      852
#define NCO1ACC2                      853
#define NCO1ACC3                      854
#define NCO1ACC4                      855
#define NCO1ACC5                      856
#define NCO1ACC6                      857
#define NCO1ACC7                      858
#define NCO1ACCH                      859
#define NCO1ACC8                      860
#define NCO1ACCH_NCO1ACC              861
#define NCO1ACC9                      862
#define NCO1ACC10                     863
#define NCO1ACC11                     864
#define NCO1ACC12                     865
#define NCO1ACC13                     866
#define NCO1ACC14                     867
#define NCO1ACC15                     868
#define NCO1ACCU                      869
#define NCO1ACCU_NCO1ACC              870
#define NCO1ACC16                     871
#define NCO1ACC17                     872
#define NCO1ACC18                     873
#define NCO1ACC19                     874
#define NCO1INCL                      875
#define NCO1INC0                      876
#define NCO1INCL_NCO1INC              877
#define NCO1INC1                      878
#define NCO1INC2                      879
#define NCO1INC3                      880
#define NCO1INC4                      881
#define NCO1INC5                      882
#define NCO1INC6                      883
#define NCO1INC7                      884
#define NCO1INCH                      885
#define NCO1INCH_NCO1INC              886
#define NCO1INC8                      887
#define NCO1INC9                      888
#define NCO1INC10                     889
#define NCO1INC11                     890
#define NCO1INC12                     891
#define NCO1INC13                     892
#define NCO1INC14                     893
#define NCO1INC15                     894
#define NCO1INCU                      895
#define NCO1INC16                     896
#define NCO1INCU_NCO1INC              897
#define NCO1INC17                     898
#define NCO1INC18                     899
#define NCO1INC19                     900
#define NCO1CON                       901
#define N1PFM                         902
#define N1POL                         903
#define N1OUT                         904
#define N1EN                          905
#define NCO1CLK                       906
#define N1CKS                         907
#define N1CKS0                        908
#define N1CKS1                        909
#define N1PWS0                        910
#define N1PWS                         911
#define N1PWS1                        912
#define N1PWS2                        913
#define OPA1CON                       914
#define OPA1PCH                       915
#define OPA1PCH0                      916
#define OPA1PCH1                      917
#define OPA1UG                        918
#define OPA1SP                        919
#define OPA1EN                        920
#define OPA2CON                       921
#define OPA2PCH                       922
#define OPA2PCH0                      923
#define OPA2PCH1                      924
#define OPA2UG                        925
#define OPA2SP                        926
#define OPA2EN                        927
#define PWM3DCL0                      928
#define PWM3DCL                       929
#define PWM3DCL1                      930
#define PWM3DCH0                      931
#define PWM3DCH                       932
#define PWM3DCH1                      933
#define PWM3DCH2                      934
#define PWM3DCH3                      935
#define PWM3DCH4                      936
#define PWM3DCH5                      937
#define PWM3DCH6                      938
#define PWM3DCH7                      939
#define PWM3CON                       940
#define PWM3POL                       941
#define PWM3OUT                       942
#define PWM3EN                        943
#define PWM4DCL                       944
#define PWM4DCL0                      945
#define PWM4DCL1                      946
#define PWM4DCH0                      947
#define PWM4DCH                       948
#define PWM4DCH1                      949
#define PWM4DCH2                      950
#define PWM4DCH3                      951
#define PWM4DCH4                      952
#define PWM4DCH5                      953
#define PWM4DCH6                      954
#define PWM4DCH7                      955
#define PWM4CON                       956
#define PWM4POL                       957
#define PWM4OUT                       958
#define PWM4EN                        959
#define COG1PHR                       960
#define G1PHR                         961
#define G1PHR0                        962
#define G1PHR1                        963
#define G1PHR2                        964
#define G1PHR3                        965
#define G1PHR4                        966
#define G1PHR5                        967
#define COG1PHF                       968
#define G1PHF0                        969
#define G1PHF                         970
#define G1PHF1                        971
#define G1PHF2                        972
#define G1PHF3                        973
#define G1PHF4                        974
#define G1PHF5                        975
#define COG1BLKR                      976
#define G1BLKR                        977
#define G1BLKR0                       978
#define G1BLKR1                       979
#define G1BLKR2                       980
#define G1BLKR3                       981
#define G1BLKR4                       982
#define G1BLKR5                       983
#define COG1BLKF                      984
#define G1BLKF                        985
#define G1BLKF0                       986
#define G1BLKF1                       987
#define G1BLKF2                       988
#define G1BLKF3                       989
#define G1BLKF4                       990
#define G1BLKF5                       991
#define COG1DBR                       992
#define G1DBR0                        993
#define G1DBR                         994
#define G1DBR1                        995
#define G1DBR2                        996
#define G1DBR3                        997
#define G1DBR4                        998
#define G1DBR5                        999
#define COG1DBF                       1000
#define G1DBF0                        1001
#define G1DBF                         1002
#define G1DBF1                        1003
#define G1DBF2                        1004
#define G1DBF3                        1005
#define G1DBF4                        1006
#define G1DBF5                        1007
#define COG1CON0                      1008
#define G1MD0                         1009
#define G1MD                          1010
#define G1MD1                         1011
#define G1MD2                         1012
#define G1CS0                         1013
#define G1CS                          1014
#define G1CS1                         1015
#define G1LD                          1016
#define G1EN                          1017
#define COG1CON1                      1018
#define G1POLA                        1019
#define G1POLB                        1020
#define G1POLC                        1021
#define G1POLD                        1022
#define G1FDBS                        1023
#define G1RDBS                        1024
#define COG1RIS                       1025
#define G1RIS0                        1026
#define G1RIS1                        1027
#define G1RIS2                        1028
#define G1RIS3                        1029
#define G1RIS4                        1030
#define G1RIS5                        1031
#define G1RIS6                        1032
#define G1RIS7                        1033
#define COG1RSIM                      1034
#define G1RSIM0                       1035
#define G1RSIM1                       1036
#define G1RSIM2                       1037
#define G1RSIM3                       1038
#define G1RSIM4                       1039
#define G1RSIM5                       1040
#define G1RSIM6                       1041
#define G1RSIM7                       1042
#define COG1FIS                       1043
#define G1FIS0                        1044
#define G1FIS1                        1045
#define G1FIS2                        1046
#define G1FIS3                        1047
#define G1FIS4                        1048
#define G1FIS5                        1049
#define G1FIS6                        1050
#define G1FIS7                        1051
#define COG1FSIM                      1052
#define G1FSIM0                       1053
#define G1FSIM1                       1054
#define G1FSIM2                       1055
#define G1FSIM3                       1056
#define G1FSIM4                       1057
#define G1FSIM5                       1058
#define G1FSIM6                       1059
#define G1FSIM7                       1060
#define COG1ASD0                      1061
#define G1ASDAC0                      1062
#define G1ASDAC                       1063
#define G1ASDAC1                      1064
#define G1ASDBD0                      1065
#define G1ASDBD                       1066
#define G1ASDBD1                      1067
#define G1ARSEN                       1068
#define G1ASE                         1069
#define COG1ASD1                      1070
#define G1AS0E                        1071
#define G1AS1E                        1072
#define G1AS2E                        1073
#define G1AS3E                        1074
#define COG1STR                       1075
#define G1STRA                        1076
#define G1STRB                        1077
#define G1STRC                        1078
#define G1STRD                        1079
#define G1SDATA                       1080
#define G1SDATB                       1081
#define G1SDATC                       1082
#define G1SDATD                       1083
#define PPSLOCK                       1084
#define PPSLOCKED                     1085
#define INTPPS                        1086
#define T0CKIPPS                      1087
#define T1CKIPPS                      1088
#define T1GPPS                        1089
#define CCP1PPS                       1090
