tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1718_tdd.h
#define CCP2PPS                       1091
#define COGINPPS                      1092
#define SSPCLKPPS                     1093
#define SSPDATPPS                     1094
#define SSPSSPPS                      1095
#define RXPPS                         1096
#define CKPPS                         1097
#define CLCIN0PPS                     1098
#define CLCIN1PPS                     1099
#define CLCIN2PPS                     1100
#define CLCIN3PPS                     1101
#define RA0PPS                        1102
#define RA1PPS                        1103
#define RA2PPS                        1104
#define RA3PPS                        1105
#define RA4PPS                        1106
#define RA5PPS                        1107
#define RA6PPS                        1108
#define RA7PPS                        1109
#define RB0PPS                        1110
#define RB1PPS                        1111
#define RB2PPS                        1112
#define RB3PPS                        1113
#define RB4PPS                        1114
#define RB5PPS                        1115
#define RB6PPS                        1116
#define RB7PPS                        1117
#define RC0PPS                        1118
#define RC1PPS                        1119
#define RC2PPS                        1120
#define RC3PPS                        1121
#define RC4PPS                        1122
#define RC5PPS                        1123
#define RC6PPS                        1124
#define RC7PPS                        1125
#define CLCDATA                       1126
#define MCLC1OUT                      1127
#define MLC1OUT                       1128
#define MCLC2OUT                      1129
#define MLC2OUT                       1130
#define MLC3OUT                       1131
#define MCLC3OUT                      1132
#define MLC4OUT                       1133
#define MCLC4OUT                      1134
#define CLC1CON                       1135
#define CLC1CON_MODE                  1136
#define LC1MODE0                      1137
#define LC1MODE                       1138
#define CLC1CON_MODE0                 1139
#define LC1MODE1                      1140
#define CLC1CON_MODE1                 1141
#define CLC1CON_MODE2                 1142
#define LC1MODE2                      1143
#define LC1INTN                       1144
#define CLC1CON_INTN                  1145
#define LC1INTP                       1146
#define CLC1CON_INTP                  1147
#define CLC1CON_OUT                   1148
#define LC1OUT                        1149
#define LC1EN                         1150
#define CLC1CON_EN                    1151
#define CLC1POL                       1152
#define LC1G1POL                      1153
#define CLC1POL_G1POL                 1154
#define CLC1POL_G2POL                 1155
#define LC1G2POL                      1156
#define LC1G3POL                      1157
#define CLC1POL_G3POL                 1158
#define LC1G4POL                      1159
#define CLC1POL_G4POL                 1160
#define CLC1POL_POL                   1161
#define LC1POL                        1162
#define CLC1SEL0                      1163
#define CLC1SEL0_D1S0                 1164
#define LC1D1S                        1165
#define LC1D1S0                       1166
#define CLC1SEL0_D1S                  1167
#define CLC1SEL0_D1S1                 1168
#define LC1D1S1                       1169
#define CLC1SEL0_D1S2                 1170
#define LC1D1S2                       1171
#define CLC1SEL0_D1S3                 1172
#define LC1D1S3                       1173
#define CLC1SEL0_D1S4                 1174
#define LC1D1S4                       1175
#define CLC1SEL1                      1176
#define CLC1SEL1_D2S0                 1177
#define CLC1SEL1_D2S                  1178
#define LC1D2S                        1179
#define LC1D2S0                       1180
#define CLC1SEL1_D2S1                 1181
#define LC1D2S1                       1182
#define LC1D2S2                       1183
#define CLC1SEL1_D2S2                 1184
#define LC1D2S3                       1185
#define CLC1SEL1_D2S3                 1186
#define LC1D2S4                       1187
#define CLC1SEL1_D2S4                 1188
#define CLC1SEL2                      1189
#define LC1D3S0                       1190
#define CLC1SEL2_D3S                  1191
#define LC1D3S                        1192
#define CLC1SEL2_D3S0                 1193
#define LC1D3S1                       1194
#define CLC1SEL2_D3S1                 1195
#define LC1D3S2                       1196
#define CLC1SEL2_D3S2                 1197
#define LC1D3S3                       1198
#define CLC1SEL2_D3S3                 1199
#define LC1D3S4                       1200
#define CLC1SEL2_D3S4                 1201
#define CLC1SEL3                      1202
#define CLC1SEL3_D4S                  1203
#define LC1D4S                        1204
#define LC1D4S0                       1205
#define CLC1SEL3_D4S0                 1206
#define CLC1SEL3_D4S1                 1207
#define LC1D4S1                       1208
#define LC1D4S2                       1209
#define CLC1SEL3_D4S2                 1210
#define LC1D4S3                       1211
#define CLC1SEL3_D4S3                 1212
#define LC1D4S4                       1213
#define CLC1SEL3_D4S4                 1214
#define CLC1GLS0                      1215
#define CLC1GLS0_D1N                  1216
#define LC1G1D1N                      1217
#define CLC1GLS0_D1T                  1218
#define LC1G1D1T                      1219
#define LC1G1D2N                      1220
#define CLC1GLS0_D2N                  1221
#define LC1G1D2T                      1222
#define CLC1GLS0_D2T                  1223
#define CLC1GLS0_D3N                  1224
#define LC1G1D3N                      1225
#define CLC1GLS0_D3T                  1226
#define LC1G1D3T                      1227
#define CLC1GLS0_D4N                  1228
#define LC1G1D4N                      1229
#define CLC1GLS0_D4T                  1230
#define LC1G1D4T                      1231
#define CLC1GLS1                      1232
#define CLC1GLS1_D1N                  1233
#define LC1G2D1N                      1234
#define LC1G2D1T                      1235
#define CLC1GLS1_D1T                  1236
#define CLC1GLS1_D2N                  1237
#define LC1G2D2N                      1238
#define LC1G2D2T                      1239
#define CLC1GLS1_D2T                  1240
#define CLC1GLS1_D3N                  1241
#define LC1G2D3N                      1242
#define LC1G2D3T                      1243
#define CLC1GLS1_D3T                  1244
#define CLC1GLS1_D4N                  1245
#define LC1G2D4N                      1246
#define LC1G2D4T                      1247
#define CLC1GLS1_D4T                  1248
#define CLC1GLS2                      1249
#define CLC1GLS2_D1N                  1250
#define LC1G3D1N                      1251
#define LC1G3D1T                      1252
#define CLC1GLS2_D1T                  1253
#define LC1G3D2N                      1254
#define CLC1GLS2_D2N                  1255
#define LC1G3D2T                      1256
#define CLC1GLS2_D2T                  1257
#define CLC1GLS2_D3N                  1258
#define LC1G3D3N                      1259
#define LC1G3D3T                      1260
#define CLC1GLS2_D3T                  1261
#define LC1G3D4N                      1262
#define CLC1GLS2_D4N                  1263
#define LC1G3D4T                      1264
#define CLC1GLS2_D4T                  1265
#define CLC1GLS3                      1266
#define LC1G4D1N                      1267
#define CLC1GLS3_G4D1N                1268
#define LC1G4D1T                      1269
#define CLC1GLS3_G4D1T                1270
#define CLC1GLS3_G4D2N                1271
#define LC1G4D2N                      1272
#define CLC1GLS3_G4D2T                1273
#define LC1G4D2T                      1274
#define LC1G4D3N                      1275
#define CLC1GLS3_G4D3N                1276
#define LC1G4D3T                      1277
#define CLC1GLS3_G4D3T                1278
#define CLC1GLS3_G4D4N                1279
#define LC1G4D4N                      1280
#define CLC1GLS3_G4D4T                1281
#define LC1G4D4T                      1282
#define CLC2CON                       1283
#define LC2MODE0                      1284
#define CLC2CON_MODE                  1285
#define LC2MODE                       1286
#define CLC2CON_MODE0                 1287
#define LC2MODE1                      1288
#define CLC2CON_MODE1                 1289
#define LC2MODE2                      1290
#define CLC2CON_MODE2                 1291
#define LC2INTN                       1292
#define CLC2CON_INTN                  1293
#define LC2INTP                       1294
#define CLC2CON_INTP                  1295
#define CLC2CON_OUT                   1296
#define LC2OUT                        1297
#define CLC2CON_EN                    1298
#define LC2EN                         1299
#define CLC2POL                       1300
#define LC2G1POL                      1301
#define CLC2POL_G1POL                 1302
#define LC2G2POL                      1303
#define CLC2POL_G2POL                 1304
#define LC2G3POL                      1305
#define CLC2POL_G3POL                 1306
#define LC2G4POL                      1307
#define CLC2POL_G4POL                 1308
#define CLC2POL_POL                   1309
#define LC2POL                        1310
#define CLC2SEL0                      1311
#define CLC2SEL0_D1S                  1312
#define LC2D1S0                       1313
#define CLC2SEL0_D1S0                 1314
#define LC2D1S                        1315
#define LC2D1S1                       1316
#define CLC2SEL0_D1S1                 1317
#define LC2D1S2                       1318
#define CLC2SEL0_D1S2                 1319
#define CLC2SEL0_D1S3                 1320
#define LC2D1S3                       1321
#define LC2D1S4                       1322
#define CLC2SEL0_D1S4                 1323
#define CLC2SEL1                      1324
#define LC2D2S0                       1325
#define CLC2SEL1_D2S0                 1326
#define LC2D2S                        1327
#define CLC2SEL1_D2S                  1328
#define LC2D2S1                       1329
#define CLC2SEL1_D2S1                 1330
#define LC2D2S2                       1331
#define CLC2SEL1_D2S2                 1332
#define LC2D2S3                       1333
#define CLC2SEL1_D2S3                 1334
#define LC2D2S4                       1335
#define CLC2SEL1_D2S4                 1336
#define CLC2SEL2                      1337
#define CLC2SEL2_D3S                  1338
#define LC2D3S0                       1339
#define CLC2SEL2_D3S0                 1340
#define LC2D3S                        1341
#define CLC2SEL2_D3S1                 1342
#define LC2D3S1                       1343
#define LC2D3S2                       1344
#define CLC2SEL2_D3S2                 1345
#define LC2D3S3                       1346
#define CLC2SEL2_D3S3                 1347
#define LC2D3S4                       1348
#define CLC2SEL2_D3S4                 1349
#define CLC2SEL3                      1350
#define LC2D4S                        1351
#define LC2D4S0                       1352
#define CLC2SEL3_D4S                  1353
#define CLC2SEL3_D4S0                 1354
#define LC2D4S1                       1355
#define CLC2SEL3_D4S1                 1356
#define LC2D4S2                       1357
#define CLC2SEL3_D4S2                 1358
#define CLC2SEL3_D4S3                 1359
#define LC2D4S3                       1360
#define LC2D4S4                       1361
#define CLC2SEL3_D4S4                 1362
#define CLC2GLS0                      1363
#define LC2G1D1N                      1364
#define CLC2GLS0_D1N                  1365
#define CLC2GLS0_D1T                  1366
#define LC2G1D1T                      1367
#define LC2G1D2N                      1368
#define CLC2GLS0_D2N                  1369
#define CLC2GLS0_D2T                  1370
#define LC2G1D2T                      1371
#define LC2G1D3N                      1372
#define CLC2GLS0_D3N                  1373
#define CLC2GLS0_D3T                  1374
#define LC2G1D3T                      1375
#define LC2G1D4N                      1376
#define CLC2GLS0_D4N                  1377
#define CLC2GLS0_D4T                  1378
#define LC2G1D4T                      1379
#define CLC2GLS1                      1380
#define CLC2GLS1_D1N                  1381
#define LC2G2D1N                      1382
#define CLC2GLS1_D1T                  1383
#define LC2G2D1T                      1384
#define CLC2GLS1_D2N                  1385
#define LC2G2D2N                      1386
#define CLC2GLS1_D2T                  1387
#define LC2G2D2T                      1388
#define LC2G2D3N                      1389
#define CLC2GLS1_D3N                  1390
#define LC2G2D3T                      1391
#define CLC2GLS1_D3T                  1392
#define LC2G2D4N                      1393
#define CLC2GLS1_D4N                  1394
#define LC2G2D4T                      1395
#define CLC2GLS1_D4T                  1396
#define CLC2GLS2                      1397
#define LC2G3D1N                      1398
#define CLC2GLS2_D1N                  1399
#define CLC2GLS2_D1T                  1400
#define LC2G3D1T                      1401
#define CLC2GLS2_D2N                  1402
#define LC2G3D2N                      1403
#define LC2G3D2T                      1404
#define CLC2GLS2_D2T                  1405
#define CLC2GLS2_D3N                  1406
#define LC2G3D3N                      1407
#define CLC2GLS2_D3T                  1408
#define LC2G3D3T                      1409
#define CLC2GLS2_D4N                  1410
#define LC2G3D4N                      1411
#define LC2G3D4T                      1412
#define CLC2GLS2_D4T                  1413
#define CLC2GLS3                      1414
#define LC2G4D1N                      1415
#define CLC2GLS3_G4D1N                1416
#define CLC2GLS3_G4D1T                1417
#define LC2G4D1T                      1418
#define CLC2GLS3_G4D2N                1419
#define LC2G4D2N                      1420
#define LC2G4D2T                      1421
#define CLC2GLS3_G4D2T                1422
#define CLC2GLS3_G4D3N                1423
#define LC2G4D3N                      1424
#define CLC2GLS3_G4D3T                1425
#define LC2G4D3T                      1426
#define LC2G4D4N                      1427
#define CLC2GLS3_G4D4N                1428
#define CLC2GLS3_G4D4T                1429
#define LC2G4D4T                      1430
#define CLC3CON                       1431
#define LC3MODE0                      1432
#define CLC3CON_MODE0                 1433
#define CLC3CON_MODE                  1434
#define LC3MODE                       1435
#define LC3MODE1                      1436
#define CLC3CON_MODE1                 1437
#define LC3MODE2                      1438
#define CLC3CON_MODE2                 1439
#define LC3INTN                       1440
#define CLC3CON_INTN                  1441
#define CLC3CON_INTP                  1442
#define LC3INTP                       1443
#define CLC3CON_OUT                   1444
#define LC3OUT                        1445
#define LC3EN                         1446
#define CLC3CON_EN                    1447
#define CLC3POL                       1448
#define LC3G1POL                      1449
#define CLC3POL_G1POL                 1450
#define LC3G2POL                      1451
#define CLC3POL_G2POL                 1452
#define CLC3POL_G3POL                 1453
#define LC3G3POL                      1454
#define LC3G4POL                      1455
#define CLC3POL_G4POL                 1456
#define LC3POL                        1457
#define CLC3POL_POL                   1458
#define CLC3SEL0                      1459
#define CLC3SEL0_D1S0                 1460
#define LC3D1S0                       1461
#define LC3D1S                        1462
#define CLC3SEL0_D1S                  1463
#define LC3D1S1                       1464
#define CLC3SEL0_D1S1                 1465
#define LC3D1S2                       1466
#define CLC3SEL0_D1S2                 1467
#define LC3D1S3                       1468
#define CLC3SEL0_D1S3                 1469
#define LC3D1S4                       1470
#define CLC3SEL0_D1S4                 1471
#define CLC3SEL1                      1472
#define CLC3SEL1_D2S                  1473
#define CLC3SEL1_D2S0                 1474
#define LC3D2S                        1475
#define LC3D2S0                       1476
#define CLC3SEL1_D2S1                 1477
#define LC3D2S1                       1478
#define CLC3SEL1_D2S2                 1479
#define LC3D2S2                       1480
#define CLC3SEL1_D2S3                 1481
#define LC3D2S3                       1482
#define LC3D2S4                       1483
#define CLC3SEL1_D2S4                 1484
#define CLC3SEL2                      1485
#define CLC3SEL2_D3S0                 1486
#define LC3D3S                        1487
#define CLC3SEL2_D3S                  1488
#define LC3D3S0                       1489
#define LC3D3S1                       1490
#define CLC3SEL2_D3S1                 1491
#define LC3D3S2                       1492
#define CLC3SEL2_D3S2                 1493
#define LC3D3S3                       1494
#define CLC3SEL2_D3S3                 1495
#define LC3D3S4                       1496
#define CLC3SEL2_D3S4                 1497
#define CLC3SEL3                      1498
#define CLC3SEL3_D4S0                 1499
#define LC3D4S0                       1500
#define LC3D4S                        1501
#define CLC3SEL3_D4S                  1502
#define LC3D4S1                       1503
#define CLC3SEL3_D4S1                 1504
#define LC3D4S2                       1505
#define CLC3SEL3_D4S2                 1506
#define LC3D4S3                       1507
#define CLC3SEL3_D4S3                 1508
#define LC3D4S4                       1509
#define CLC3SEL3_D4S4                 1510
#define CLC3GLS0                      1511
#define CLC3GLS0_D1N                  1512
#define LC3G1D1N                      1513
#define LC3G1D1T                      1514
#define CLC3GLS0_D1T                  1515
#define LC3G1D2N                      1516
#define CLC3GLS0_D2N                  1517
#define CLC3GLS0_D2T                  1518
#define LC3G1D2T                      1519
#define CLC3GLS0_D3N                  1520
#define LC3G1D3N                      1521
#define LC3G1D3T                      1522
#define CLC3GLS0_D3T                  1523
#define CLC3GLS0_D4N                  1524
#define LC3G1D4N                      1525
#define CLC3GLS0_D4T                  1526
#define LC3G1D4T                      1527
#define CLC3GLS1                      1528
#define LC3G2D1N                      1529
#define CLC3GLS1_D1N                  1530
#define CLC3GLS1_D1T                  1531
#define LC3G2D1T                      1532
#define LC3G2D2N                      1533
#define CLC3GLS1_D2N                  1534
#define LC3G2D2T                      1535
#define CLC3GLS1_D2T                  1536
#define LC3G2D3N                      1537
#define CLC3GLS1_D3N                  1538
#define CLC3GLS1_D3T                  1539
#define LC3G2D3T                      1540
#define LC3G2D4N                      1541
#define CLC3GLS1_D4N                  1542
#define LC3G2D4T                      1543
#define CLC3GLS1_D4T                  1544
#define CLC3GLS2                      1545
#define LC3G3D1N                      1546
#define CLC3GLS2_D1N                  1547
#define LC3G3D1T                      1548
#define CLC3GLS2_D1T                  1549
#define CLC3GLS2_D2N                  1550
#define LC3G3D2N                      1551
#define CLC3GLS2_D2T                  1552
#define LC3G3D2T                      1553
#define CLC3GLS2_D3N                  1554
#define LC3G3D3N                      1555
#define LC3G3D3T                      1556
#define CLC3GLS2_D3T                  1557
#define CLC3GLS2_D4N                  1558
#define LC3G3D4N                      1559
#define CLC3GLS2_D4T                  1560
#define LC3G3D4T                      1561
#define CLC3GLS3                      1562
#define LC3G4D1N                      1563
#define CLC3GLS3_G4D1N                1564
#define LC3G4D1T                      1565
#define CLC3GLS3_G4D1T                1566
#define LC3G4D2N                      1567
#define CLC3GLS3_G4D2N                1568
#define CLC3GLS3_G4D2T                1569
#define LC3G4D2T                      1570
#define LC3G4D3N                      1571
#define CLC3GLS3_G4D3N                1572
#define CLC3GLS3_G4D3T                1573
#define LC3G4D3T                      1574
#define LC3G4D4N                      1575
#define CLC3GLS3_G4D4N                1576
#define LC3G4D4T                      1577
#define CLC3GLS3_G4D4T                1578
#define CLC4CON                       1579
#define LC4MODE                       1580
#define CLC4CON_MODE                  1581
#define LC4MODE0                      1582
#define CLC4CON_MODE0                 1583
#define LC4MODE1                      1584
#define CLC4CON_MODE1                 1585
#define LC4MODE2                      1586
#define CLC4CON_MODE2                 1587
#define LC4INTN                       1588
#define CLC4CON_INTN                  1589
#define CLC4CON_INTP                  1590
#define LC4INTP                       1591
#define CLC4CON_OUT                   1592
#define LC4OUT                        1593
#define CLC4CON_EN                    1594
#define LC4EN                         1595
#define CLC4POL                       1596
#define CLC4POL_G1POL                 1597
#define LC4G1POL                      1598
#define CLC4POL_G2POL                 1599
#define LC4G2POL                      1600
#define CLC4POL_G3POL                 1601
#define LC4G3POL                      1602
#define LC4G4POL                      1603
#define CLC4POL_G4POL                 1604
#define LC4POL                        1605
#define CLC4POL_POL                   1606
#define CLC4SEL0                      1607
#define CLC4SEL0_D1S0                 1608
#define LC4D1S0                       1609
#define CLC4SEL0_D1S                  1610
#define LC4D1S                        1611
#define CLC4SEL0_D1S1                 1612
#define LC4D1S1                       1613
#define CLC4SEL0_D1S2                 1614
#define LC4D1S2                       1615
#define CLC4SEL0_D1S3                 1616
#define LC4D1S3                       1617
#define CLC4SEL0_D1S4                 1618
#define LC4D1S4                       1619
#define CLC4SEL1                      1620
#define LC4D2S                        1621
#define LC4D2S0                       1622
#define CLC4SEL1_D2S                  1623
#define CLC4SEL1_D2S0                 1624
#define LC4D2S1                       1625
#define CLC4SEL1_D2S1                 1626
#define LC4D2S2                       1627
#define CLC4SEL1_D2S2                 1628
#define LC4D2S3                       1629
#define CLC4SEL1_D2S3                 1630
#define LC4D2S4                       1631
#define CLC4SEL1_D2S4                 1632
#define CLC4SEL2                      1633
#define LC4D3S                        1634
#define CLC4SEL2_D3S                  1635
#define CLC4SEL2_D3S0                 1636
#define LC4D3S0                       1637
#define LC4D3S1                       1638
#define CLC4SEL2_D3S1                 1639
#define CLC4SEL2_D3S2                 1640
#define LC4D3S2                       1641
#define CLC4SEL2_D3S3                 1642
#define LC4D3S3                       1643
#define LC4D3S4                       1644
#define CLC4SEL2_D3S4                 1645
#define CLC4SEL3                      1646
#define LC4D4S0                       1647
#define LC4D4S                        1648
