tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1718_tdd.h
#define CLC4SEL3_D4S0                 1649
#define CLC4SEL3_D4S                  1650
#define LC4D4S1                       1651
#define CLC4SEL3_D4S1                 1652
#define LC4D4S2                       1653
#define CLC4SEL3_D4S2                 1654
#define LC4D4S3                       1655
#define CLC4SEL3_D4S3                 1656
#define LC4D4S4                       1657
#define CLC4SEL3_D4S4                 1658
#define CLC4GLS0                      1659
#define CLC4GLS0_D1N                  1660
#define LC4G1D1N                      1661
#define CLC4GLS0_D1T                  1662
#define LC4G1D1T                      1663
#define CLC4GLS0_D2N                  1664
#define LC4G1D2N                      1665
#define CLC4GLS0_D2T                  1666
#define LC4G1D2T                      1667
#define CLC4GLS0_D3N                  1668
#define LC4G1D3N                      1669
#define CLC4GLS0_D3T                  1670
#define LC4G1D3T                      1671
#define CLC4GLS0_D4N                  1672
#define LC4G1D4N                      1673
#define CLC4GLS0_D4T                  1674
#define LC4G1D4T                      1675
#define CLC4GLS1                      1676
#define CLC4GLS1_D1N                  1677
#define LC4G2D1N                      1678
#define CLC4GLS1_D1T                  1679
#define LC4G2D1T                      1680
#define LC4G2D2N                      1681
#define CLC4GLS1_D2N                  1682
#define LC4G2D2T                      1683
#define CLC4GLS1_D2T                  1684
#define CLC4GLS1_D3N                  1685
#define LC4G2D3N                      1686
#define LC4G2D3T                      1687
#define CLC4GLS1_D3T                  1688
#define CLC4GLS1_D4N                  1689
#define LC4G2D4N                      1690
#define CLC4GLS1_D4T                  1691
#define LC4G2D4T                      1692
#define CLC4GLS2                      1693
#define CLC4GLS2_D1N                  1694
#define LC4G3D1N                      1695
#define CLC4GLS2_D1T                  1696
#define LC4G3D1T                      1697
#define LC4G3D2N                      1698
#define CLC4GLS2_D2N                  1699
#define LC4G3D2T                      1700
#define CLC4GLS2_D2T                  1701
#define CLC4GLS2_D3N                  1702
#define LC4G3D3N                      1703
#define CLC4GLS2_D3T                  1704
#define LC4G3D3T                      1705
#define LC4G3D4N                      1706
#define CLC4GLS2_D4N                  1707
#define LC4G3D4T                      1708
#define CLC4GLS2_D4T                  1709
#define CLC4GLS3                      1710
#define CLC4GLS3_G4D1N                1711
#define LC4G4D1N                      1712
#define LC4G4D1T                      1713
#define CLC4GLS3_G4D1T                1714
#define LC4G4D2N                      1715
#define CLC4GLS3_G4D2N                1716
#define LC4G4D2T                      1717
#define CLC4GLS3_G4D2T                1718
#define CLC4GLS3_G4D3N                1719
#define LC4G4D3N                      1720
#define CLC4GLS3_G4D3T                1721
#define LC4G4D3T                      1722
#define LC4G4D4N                      1723
#define CLC4GLS3_G4D4N                1724
#define LC4G4D4T                      1725
#define CLC4GLS3_G4D4T                1726
#define STATUS_SHAD                   1727
#define C_SHAD                        1728
#define DC_SHAD                       1729
#define Z_SHAD                        1730
#define WREG_SHAD                     1731
#define BSR_SHAD                      1732
#define PCLATH_SHAD                   1733
#define FSR0L_SHAD                    1734
#define FSR0H_SHAD                    1735
#define FSR1L_SHAD                    1736
#define FSR1H_SHAD                    1737
#define STKPTR                        1738
#define TOSL                          1739
#define TOSH                          1740

#endif // _PIC16LF1718_H_
